---
kind: method
id: M:Autodesk.Revit.DB.Architecture.SiteSubRegion.GetBoundary
source: html/44b8d6bc-8903-1a37-f5a4-53b239d744d8.htm
---
# Autodesk.Revit.DB.Architecture.SiteSubRegion.GetBoundary Method

Gets the boundary of current subregion.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetBoundary()
```

## Returns
The curve loops that represent the boundary.